<?php
//این فایل از روش 
//PDO  (PHP DATA OBJECT) 
//متصل می شود
#در اینجا اطلاعات شامل آدرس هاست ، نام کاربری
#رمز عبور و نام دیتابیس داده میشود
//مقادیر باید در متغیرها ذخیره گردند
$host = "localhost";
$username = "root";
$password = "naghi06578";
$database = "mysiteusers";
//هر گاه دستوراتی را بخواهیم بنویسیم که امکان ایجاد خطا یا وجود
//اسنثتاء داشته باشند در ساختار 
//قرار می دهیم try
//و آن خطا یا استثناء احتمالی را توسط معرفی یک ویژگی یا خطا ثبت میکنیم
try {
    //در اینجا یک شیء میسازیم که به دیتابیس وصل شود
    //با همان متغیرهای بالا
    $pdo = new PDO(
        "mysql:host=$host;dbname=$database;charset=utf8mb4",
        $username,
        $password
    );
//خطا یا استثناء احتمالی را در ویژگی های سیء ثبت میکنیم
    $pdo->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
//استفاده میکنیم try وقتی از
//دریافت کنیم catch باید خطا را توسط
//و دستورات لازم را کد نویسی کنیم
} catch (PDOException $e) {
    exit("خطا در اتصال به دیتابیس.");
}

?>